tests/load/api-load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: 'Warm up'
    - duration: 120
      arrivalRate: 50
      name: 'Sustained load'
    - duration: 60
      arrivalRate: 100
      name: 'Peak load'
  processor: './load-test-processor.js'

scenarios:
  - name: 'Health Check Load Test'
    weight: 30
    flow:
      - get:
          url: '/health'
          expect:
            - statusCode: 200
            - contentType: json

  - name: 'API Root Load Test'
    weight: 20
    flow:
      - get:
          url: '/'
          expect:
            - statusCode: 200

  - name: 'Authentication Flow'
    weight: 50
    flow:
      - post:
          url: '/api/v1/auth/login'
          json:
            email: 'test@example.com'
            password: 'TestPassword123!'
          capture:
            - json: '$.data.token'
              as: 'authToken'
      - get:
          url: '/api/v1/auth/profile'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          expect:
            - statusCode: [200, 401]